package com.company;

public class Main {

    public static void main(String[] args) {
        System.out.println("1. Git - это распределенная система контроля версий. ");
        System.out.println("2. Для того, чтобы легче работать с командой, просмотривать предыдущие " +
                "коды,что изменилось, чтобы легко отправлять проект. ");
        System.out.println("3. Локальныый репозиторий - это репозиторий, который хранится на собственном компьютере.");
        System.out.println("3. Удаленный репозиторий - это репозиторий, который существует где-то в сервере.");
        System.out.println("4. Commit(фиксация) - сохраняет изменения после фиксации.");
        System.out.println("5. Push - отправляет внесенные изменения в локальной репозитории в удаленную. ");
        System.out.println("6. Ветки нужны для того, чтобы удобно было работать с командой и не мешать друг другу.");

    }
}
